# Matt's set of basic packages.

# To start, you need to do this:
#    brew tap homebrew/boneyard
# Then, you can cd here and do this:
#    brew bundle

# Install cask, so I can install GUI apps, too.
tap "caskroom/cask"

# useful stuff for my programming hobby
brew "graphviz"
brew "heroku"
brew "imagemagick"
brew "jq"
brew "moreutils" # particularly for the `ts` command
brew "pstree"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "tcptrace"
brew "the_silver_searcher" # ag, ack replacement
brew "tmux"
brew "watch"

# other apps that I use
brew "ledger"
brew "youtube-dl"

cask "bonjour-browser"
cask "dropbox"
cask "firefox"
cask "gnucash"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "keepassx"
cask "keybase"
cask "spotify"
cask "virtualbox"
cask "viscosity"

# fun mistyped commands
brew "gti"
brew "sl"

# these should go in projects' Brewfiles
#brew "mercurial"
#brew "subversion"

#wip - trying to get gpg commit signing set up again :(
brew "gnupg"
brew "pinentry-mac"
