# Matt's set of basic packages.

# To start, you need to do this:
#    brew tap homebrew/boneyard
# Then, you can cd here and do this:
#    brew bundle

# Install cask, so I can install GUI apps, too.
tap "caskroom/cask"

# useful stuff for my programming hobby
brew "ack"
brew "graphviz"
brew "heroku"
brew "imagemagick"
brew "jq"
brew "moreutils" # particularly for the `ts` command
brew "pstree"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "tcptrace"
brew "tmux"
brew "watch"
brew "wget"

# GitHub apps
cask "atom"
#cask "github-chat"
#cask "github-team"

# other apps that I use
brew "ledger"
brew "youtube-dl"

#cask "adium"
#cask "alfred"
cask "amazon-music"
cask "bonjour-browser"
#cask "crashplan"
cask "dropbox"
cask "firefox"
cask "gnucash"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "keepassx"
cask "linein"
cask "macvim"
cask "nvalt"
#cask "p4merge"
#cask "rdio"
cask "screenhero"
#cask "skitch"
#cask "skype"
#cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
#cask "xquartz"
cask "vlc"

# fun mistyped commands
brew "gti"
brew "sl"

# these should go in projects' Brewfiles
#brew "mercurial"
#brew "subversion"
