# Matt's set of basic packages.

# Then, you can cd here and do this:
#    brew bundle

tap "homebrew/cask-fonts"

# useful stuff for my programming hobby
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "moreutils" # particularly for the `ts` command
brew "mtr"
brew "neovim"
brew "pstree"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "rustup-init"
brew "starship"
brew "tcptrace"
brew "the_silver_searcher" # ag, ack replacement
brew "tmux"
brew "watch"

# other apps that I use
brew "gnucash"
brew "handbrake"
brew "keepassxc"
brew "iterm2"
brew "ledger"
brew "yt-dlp"

# Things I might want to use homebrew to install, but might not.
#cask "firefox"
#cask "google-chrome"
#cask "keybase"
#cask "spotify"
#cask "virtualbox"
#cask "viscosity"
#cask "visual-studio-code"

#wip - trying to get gpg commit signing set up again :(
#brew "gnupg"
#brew "pinentry-mac"

# fonts
cask "font-fira-mono-nerd-font"
